
Процедура ПередЗаписью(Отказ)
	Если НЕ Ссылка.Выполнена И Выполнена Тогда
		ДатаВыполнения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Заявки") Тогда
		// Заполнение шапки
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Заявка = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
